EnviroDIY/EnviroDIYAVRBoards/boards.txt

# -----------------------------------
envirodiy_mayfly.name=EnviroDIY Mayfly
# -----------------------------------

# Upload
envirodiy_mayfly.upload.tool=arduino:avrdude
envirodiy_mayfly.upload.protocol=arduino
envirodiy_mayfly.upload.maximum_size=130048
envirodiy_mayfly.upload.speed=57600

# Build
envirodiy_mayfly.build.mcu=atmega1284p
envirodiy_mayfly.build.f_cpu=8000000L
envirodiy_mayfly.build.core=arduino:arduino
envirodiy_mayfly.build.board=AVR_ENVIRODIY_MAYFLY
envirodiy_mayfly.build.variant=mayfly
envirodiy_mayfly.build.extra_flags=-D__ATMEGA1284p__ -DSD_CHIP_SELECT_MODE=1 -DENVIRODIY_MAYFLY -DARDUINO_AVR_ENVIRODIY_MAYFLY {build.usb_flags}

# Bootloader
envirodiy_mayfly.bootloader.tool=arduino:avrdude
envirodiy_mayfly.bootloader.low_fuses=0xFF
envirodiy_mayfly.bootloader.high_fuses=0xD6
envirodiy_mayfly.bootloader.extended_fuses=0xFD
#{vendor_name}_mayfly.bootloader.path=optiboot
envirodiy_mayfly.bootloader.file=optiboot/optiboot_atmega1284p.hex
envirodiy_mayfly.bootloader.unlock_bits=0x3F
envirodiy_mayfly.bootloader.lock_bits=0x2F



# -----------------------------------
envirodiy_mayfly2.name=EnviroDIY Mayfly v2
# -----------------------------------

# Upload
envirodiy_mayfly2.upload.tool=arduino:avrdude
envirodiy_mayfly2.upload.protocol=arduino
envirodiy_mayfly2.upload.maximum_size=130048
envirodiy_mayfly2.upload.speed=57600

# Build
envirodiy_mayfly2.build.mcu=atmega1284p
envirodiy_mayfly2.build.f_cpu=8000000L
envirodiy_mayfly2.build.core=arduino:arduino
envirodiy_mayfly2.build.board=AVR_ENVIRODIY_MAYFLY_2
envirodiy_mayfly2.build.variant=mayfly2
envirodiy_mayfly2.build.extra_flags=-D__ATMEGA1284p__ -DSD_CHIP_SELECT_MODE=1 -DENVIRODIY_MAYFLY2 -DARDUINO_AVR_ENVIRODIY_MAYFLY2 {build.usb_flags}

# Bootloader
envirodiy_mayfly2.bootloader.tool=arduino:avrdude
envirodiy_mayfly2.bootloader.low_fuses=0xFF
envirodiy_mayfly2.bootloader.high_fuses=0xD6
envirodiy_mayfly2.bootloader.extended_fuses=0xFD
#{vendor_name}_mayfly2.bootloader.path=optiboot
envirodiy_mayfly2.bootloader.file=optiboot/optiboot_atmega1284p.hex
envirodiy_mayfly2.bootloader.unlock_bits=0x3F
envirodiy_mayfly2.bootloader.lock_bits=0x2F


